# Brewfile - Modern dependency management
# Install: brew bundle
# Update: brew bundle dump --force

tap "homebrew/cask"
tap "homebrew/core"

# Shell & Terminal
brew "zsh"
brew "starship"              # Modern prompt (alternative to p10k)

# Modern CLI Replacements
brew "eza"                   # Better ls
brew "bat"                   # Better cat
brew "fd"                    # Better find
brew "ripgrep"              # Better grep
brew "dust"                 # Better du
brew "duf"                  # Better df
brew "procs"                # Better ps
brew "bottom"               # Better top/htop

# Developer Tools
brew "git"
brew "git-delta"            # Better diffs
brew "gh"                   # GitHub CLI
brew "lazygit"              # Terminal UI for git
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor

# Version Managers
brew "fnm"                  # Fast Node Manager
brew "jenv"                 # Java version manager

# Productivity Tools
brew "fzf"                  # Fuzzy finder
brew "zoxide"               # Smart cd
brew "atuin"                # Magical shell history
brew "tldr"                 # Simplified man pages
brew "direnv"               # Auto env vars per directory
brew "hyperfine"            # Command-line benchmarking

# Network & System
brew "wget"
brew "mtr"                  # Network diagnostics
brew "iftop"                # Network monitoring
brew "ncdu"                 # Disk usage analyzer
brew "htop"                 # Process viewer
brew "telnet"

# Other Tools
brew "go"
brew "shpotify"             # Spotify CLI
brew "pidcat"               # Android logcat

# Applications
cask "iterm2"
cask "visual-studio-code"
cask "sublime-merge"
cask "docker-desktop"
cask "raycast"
cask "dropbox"
cask "slack"
cask "spotify"
cask "flux-app"
cask "zen"
cask "sourcetree"
cask "postman"
cask "charles"
cask "android-studio"
cask "virtualbox"

# Java
cask "temurin@8"
cask "temurin@17"
